# Big Countries

SQL Schema

There is a table World.


| name | continent   | area | population   | gdp |
|------|------|------|------|------|
|  Afghanistan   |  Asia   |  652230   |  25500100   | 20343000    |
|  Albania   |  Europe   |  28748   |  2831741   |  12960000   |
|  Algeria   |  Africa   |  2381741   |  37100000   |  188681000   |
|  Andorra   |  Europe   |  468   |  78115   |  3712000   |
|  Angola   |   Africa  |  1246700   |  20609294   |  100990000   |



A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries' name, population and area.

For example, according to the above table, we should output:

| name | population   | area|
|------|------|------|
|   Afghanistan  |25500100|652230|
|   Algeria  |37100000|2381741|

In [1]:
import sqlite3 as sql
import pandas as pd

In [2]:
db = sql.connect(':memory:')
cursor = db.cursor()

In [3]:
cursor.execute("CREATE TABLE World(name TEXT PRIMARY KEY,continent TEXT,area INTEGER,population INTEGER,gdp INTEGER)")

db.commit()

In [4]:
cursor.execute('''INSERT INTO World values ('Afghanistan','Asia',652230,25500100,20343000)''')
cursor.execute('''INSERT INTO World values ('Albania','Europe',28748,2831741,12960000)''')
cursor.execute('''INSERT INTO World values ('Algeria','Africa',2381741,37100000,188681000)''')
cursor.execute('''INSERT INTO World values ('Andorra','Europe',468,78115,3712000)''')
cursor.execute('''INSERT INTO World values ('Angola','Africa',1246700,20609294,100990000)''')

db.commit()

In [5]:
dfbook = pd.read_sql_query("SELECT name,population,area FROM World WHERE (population > 25000000 OR area > 3000000)",db)

dfbook

          name  population     area
0  Afghanistan    25500100   652230
1      Algeria    37100000  2381741